karacasoft/qemu/hw/misc/lpc4088_iocon.c
#include "qemu/osdep.h"
#include "hw/sysbus.h"
#include "migration/vmstate.h"
#include "qemu/log.h"
#include "qemu/module.h"
#include "hw/misc/lpc4088_iocon.h"

#ifndef LPC4088_IOCON_ERROR_DEBUG
#define LPC4088_IOCON_ERROR_DEBUG 0
#endif

#define DEBUG_PRINT(fmt, args...) if(LPC4088_IOCON_ERROR_DEBUG) {fprintf(stderr, "[%s->%s]:" fmt, TYPE_LPC4088_IOCON,__func__, ##args);}

static void lpc4088_iocon_reset(DeviceState *dev) {
    LPC4088IOCONState *s = LPC4088IOCON(dev);
	
	s->iocon_P0_0 = 0x00000000;
	s->iocon_P0_1 = 0x00000000;
	s->iocon_P0_2 = 0x00000000;
	s->iocon_P0_3 = 0x00000000;
	s->iocon_P0_4 = 0x00000000;
	s->iocon_P0_5 = 0x00000000;
	s->iocon_P0_6 = 0x00000000;
	s->iocon_P0_7 = 0x00000000;

	s->iocon_P0_8 = 0x00000000;				/* 0x020 */
	s->iocon_P0_9 = 0x00000000;
	s->iocon_P0_10 = 0x00000000;
	s->iocon_P0_11 = 0x00000000;
	s->iocon_P0_12 = 0x00000000;
	s->iocon_P0_13 = 0x00000000;
	s->iocon_P0_14 = 0x00000000;
	s->iocon_P0_15 = 0x00000000;

	s->iocon_P0_16 = 0x00000000;				/* 0x040 */
	s->iocon_P0_17 = 0x00000000;
	s->iocon_P0_18 = 0x00000000;
	s->iocon_P0_19 = 0x00000000;
	s->iocon_P0_20 = 0x00000000;
	s->iocon_P0_21 = 0x00000000;
	s->iocon_P0_22 = 0x00000000;
	s->iocon_P0_23 = 0x00000000;

	s->iocon_P0_24 = 0x00000000;				/* 0x060 */
	s->iocon_P0_25 = 0x00000000;
	s->iocon_P0_26 = 0x00000000;
	s->iocon_P0_27 = 0x00000000;
	s->iocon_P0_28 = 0x00000000;
	s->iocon_P0_29 = 0x00000000;
	s->iocon_P0_30 = 0x00000000;
	s->iocon_P0_31 = 0x00000000;

	s->iocon_P1_0 = 0x00000000;				/* 0x080 */
	s->iocon_P1_1 = 0x00000000;
	s->iocon_P1_2 = 0x00000000;
	s->iocon_P1_3 = 0x00000000;
	s->iocon_P1_4 = 0x00000000;
	s->iocon_P1_5 = 0x00000000;
	s->iocon_P1_6 = 0x00000000;
	s->iocon_P1_7 = 0x00000000;

	s->iocon_P1_8 = 0x00000000;				/* 0x0A0 */
	s->iocon_P1_9 = 0x00000000;
	s->iocon_P1_10 = 0x00000000;
	s->iocon_P1_11 = 0x00000000;
	s->iocon_P1_12 = 0x00000000;
	s->iocon_P1_13 = 0x00000000;
	s->iocon_P1_14 = 0x00000000;
	s->iocon_P1_15 = 0x00000000;

	s->iocon_P1_16 = 0x00000000;				/* 0x0C0 */
	s->iocon_P1_17 = 0x00000000;
	s->iocon_P1_18 = 0x00000000;
	s->iocon_P1_19 = 0x00000000;
	s->iocon_P1_20 = 0x00000000;
	s->iocon_P1_21 = 0x00000000;
	s->iocon_P1_22 = 0x00000000;
	s->iocon_P1_23 = 0x00000000;

	s->iocon_P1_24 = 0x00000000;				/* 0x0E0 */
	s->iocon_P1_25 = 0x00000000;
	s->iocon_P1_26 = 0x00000000;
	s->iocon_P1_27 = 0x00000000;
	s->iocon_P1_28 = 0x00000000;
	s->iocon_P1_29 = 0x00000000;
	s->iocon_P1_30 = 0x00000000;
	s->iocon_P1_31 = 0x00000000;

	s->iocon_P2_0 = 0x00000000;				/* 0x100 */
	s->iocon_P2_1 = 0x00000000;
	s->iocon_P2_2 = 0x00000000;
	s->iocon_P2_3 = 0x00000000;
	s->iocon_P2_4 = 0x00000000;
	s->iocon_P2_5 = 0x00000000;
	s->iocon_P2_6 = 0x00000000;
	s->iocon_P2_7 = 0x00000000;

	s->iocon_P2_8 = 0x00000000;				/* 0x120 */
	s->iocon_P2_9 = 0x00000000;
	s->iocon_P2_10 = 0x00000000;
	s->iocon_P2_11 = 0x00000000;
	s->iocon_P2_12 = 0x00000000;
	s->iocon_P2_13 = 0x00000000;
	s->iocon_P2_14 = 0x00000000;
	s->iocon_P2_15 = 0x00000000;

	s->iocon_P2_16 = 0x00000000;				/* 0x140 */
	s->iocon_P2_17 = 0x00000000;
	s->iocon_P2_18 = 0x00000000;
	s->iocon_P2_19 = 0x00000000;
	s->iocon_P2_20 = 0x00000000;
	s->iocon_P2_21 = 0x00000000;
	s->iocon_P2_22 = 0x00000000;
	s->iocon_P2_23 = 0x00000000;

	s->iocon_P2_24 = 0x00000000;				/* 0x160 */
	s->iocon_P2_25 = 0x00000000;
	s->iocon_P2_26 = 0x00000000;
	s->iocon_P2_27 = 0x00000000;
	s->iocon_P2_28 = 0x00000000;
	s->iocon_P2_29 = 0x00000000;
	s->iocon_P2_30 = 0x00000000;
	s->iocon_P2_31 = 0x00000000;

	s->iocon_P3_0 = 0x00000000;				/* 0x180 */
	s->iocon_P3_1 = 0x00000000;
	s->iocon_P3_2 = 0x00000000;
	s->iocon_P3_3 = 0x00000000;
	s->iocon_P3_4 = 0x00000000;
	s->iocon_P3_5 = 0x00000000;
	s->iocon_P3_6 = 0x00000000;
	s->iocon_P3_7 = 0x00000000;

	s->iocon_P3_8 = 0x00000000;				/* 0x1A0 */
	s->iocon_P3_9 = 0x00000000;
	s->iocon_P3_10 = 0x00000000;
	s->iocon_P3_11 = 0x00000000;
	s->iocon_P3_12 = 0x00000000;
	s->iocon_P3_13 = 0x00000000;
	s->iocon_P3_14 = 0x00000000;
	s->iocon_P3_15 = 0x00000000;

	s->iocon_P3_16 = 0x00000000;				/* 0x1C0 */
	s->iocon_P3_17 = 0x00000000;
	s->iocon_P3_18 = 0x00000000;
	s->iocon_P3_19 = 0x00000000;
	s->iocon_P3_20 = 0x00000000;
	s->iocon_P3_21 = 0x00000000;
	s->iocon_P3_22 = 0x00000000;
	s->iocon_P3_23 = 0x00000000;

	s->iocon_P3_24 = 0x00000000;				/* 0x1E0 */
	s->iocon_P3_25 = 0x00000000;
	s->iocon_P3_26 = 0x00000000;
	s->iocon_P3_27 = 0x00000000;
	s->iocon_P3_28 = 0x00000000;
	s->iocon_P3_29 = 0x00000000;
	s->iocon_P3_30 = 0x00000000;
	s->iocon_P3_31 = 0x00000000;

	s->iocon_P4_0 = 0x00000000;				/* 0x200 */
	s->iocon_P4_1 = 0x00000000;
	s->iocon_P4_2 = 0x00000000;
	s->iocon_P4_3 = 0x00000000;
	s->iocon_P4_4 = 0x00000000;
	s->iocon_P4_5 = 0x00000000;
	s->iocon_P4_6 = 0x00000000;
	s->iocon_P4_7 = 0x00000000;

	s->iocon_P4_8 = 0x00000000;				/* 0x220 */
	s->iocon_P4_9 = 0x00000000;
	s->iocon_P4_10 = 0x00000000;
	s->iocon_P4_11 = 0x00000000;
	s->iocon_P4_12 = 0x00000000;
	s->iocon_P4_13 = 0x00000000;
	s->iocon_P4_14 = 0x00000000;
	s->iocon_P4_15 = 0x00000000;

	s->iocon_P4_16 = 0x00000000;				/* 0x240 */
	s->iocon_P4_17 = 0x00000000;
	s->iocon_P4_18 = 0x00000000;
	s->iocon_P4_19 = 0x00000000;
	s->iocon_P4_20 = 0x00000000;
	s->iocon_P4_21 = 0x00000000;
	s->iocon_P4_22 = 0x00000000;
	s->iocon_P4_23 = 0x00000000;

	s->iocon_P4_24 = 0x00000000;				/* 0x260 */
	s->iocon_P4_25 = 0x00000000;
	s->iocon_P4_26 = 0x00000000;
	s->iocon_P4_27 = 0x00000000;
	s->iocon_P4_28 = 0x00000000;
	s->iocon_P4_29 = 0x00000000;
	s->iocon_P4_30 = 0x00000000;
	s->iocon_P4_31 = 0x00000000;

	s->iocon_P5_0 = 0x00000000;				/* 0x280 */
	s->iocon_P5_1 = 0x00000000;
	s->iocon_P5_2 = 0x00000000;
	s->iocon_P5_3 = 0x00000000;
	s->iocon_P5_4 = 0x00000000;				/* 0x290 */
}

static uint64_t lpc4088_iocon_read(void *opaque, hwaddr addr, unsigned int size) {
    LPC4088IOCONState *s = opaque;

    switch (addr) {
    case LPC4088_IOCON_REG_P0_0:
		return s->iocon_P0_0;
	case LPC4088_IOCON_REG_P0_1:
		return s->iocon_P0_1;
	case LPC4088_IOCON_REG_P0_2:
		return s->iocon_P0_2;
	case LPC4088_IOCON_REG_P0_3:
		return s->iocon_P0_3;
	case LPC4088_IOCON_REG_P0_4:
		return s->iocon_P0_4;
	case LPC4088_IOCON_REG_P0_5:
		return s->iocon_P0_5;
	case LPC4088_IOCON_REG_P0_6:
		return s->iocon_P0_6;
	case LPC4088_IOCON_REG_P0_7:
		return s->iocon_P0_7;
	case LPC4088_IOCON_REG_P0_8:
		return s->iocon_P0_8;
	case LPC4088_IOCON_REG_P0_9:
		return s->iocon_P0_9;
	case LPC4088_IOCON_REG_P0_10:
		return s->iocon_P0_10;
	case LPC4088_IOCON_REG_P0_11:
		return s->iocon_P0_11;
	case LPC4088_IOCON_REG_P0_12:
		return s->iocon_P0_12;
	case LPC4088_IOCON_REG_P0_13:
		return s->iocon_P0_13;
	case LPC4088_IOCON_REG_P0_14:
		return s->iocon_P0_14;
	case LPC4088_IOCON_REG_P0_15:
		return s->iocon_P0_15;
	case LPC4088_IOCON_REG_P0_16:
		return s->iocon_P0_16;
	case LPC4088_IOCON_REG_P0_17:
		return s->iocon_P0_17;
	case LPC4088_IOCON_REG_P0_18:
		return s->iocon_P0_18;
	case LPC4088_IOCON_REG_P0_19:
		return s->iocon_P0_19;
	case LPC4088_IOCON_REG_P0_20:
		return s->iocon_P0_20;
	case LPC4088_IOCON_REG_P0_21:
		return s->iocon_P0_21;
	case LPC4088_IOCON_REG_P0_22:
		return s->iocon_P0_22;
	case LPC4088_IOCON_REG_P0_23:
		return s->iocon_P0_23;
	case LPC4088_IOCON_REG_P0_24:
		return s->iocon_P0_24;
	case LPC4088_IOCON_REG_P0_25:
		return s->iocon_P0_25;
	case LPC4088_IOCON_REG_P0_26:
		return s->iocon_P0_26;
	case LPC4088_IOCON_REG_P0_27:
		return s->iocon_P0_27;
	case LPC4088_IOCON_REG_P0_28:
		return s->iocon_P0_28;
	case LPC4088_IOCON_REG_P0_29:
		return s->iocon_P0_29;
	case LPC4088_IOCON_REG_P0_30:
		return s->iocon_P0_30;
	case LPC4088_IOCON_REG_P0_31:
		return s->iocon_P0_31;
	case LPC4088_IOCON_REG_P1_0:
		return s->iocon_P1_0;
	case LPC4088_IOCON_REG_P1_1:
		return s->iocon_P1_1;
	case LPC4088_IOCON_REG_P1_2:
		return s->iocon_P1_2;
	case LPC4088_IOCON_REG_P1_3:
		return s->iocon_P1_3;
	case LPC4088_IOCON_REG_P1_4:
		return s->iocon_P1_4;
	case LPC4088_IOCON_REG_P1_5:
		return s->iocon_P1_5;
	case LPC4088_IOCON_REG_P1_6:
		return s->iocon_P1_6;
	case LPC4088_IOCON_REG_P1_7:
		return s->iocon_P1_7;
	case LPC4088_IOCON_REG_P1_8:
		return s->iocon_P1_8;
	case LPC4088_IOCON_REG_P1_9:
		return s->iocon_P1_9;
	case LPC4088_IOCON_REG_P1_10:
		return s->iocon_P1_10;
	case LPC4088_IOCON_REG_P1_11:
		return s->iocon_P1_11;
	case LPC4088_IOCON_REG_P1_12:
		return s->iocon_P1_12;
	case LPC4088_IOCON_REG_P1_13:
		return s->iocon_P1_13;
	case LPC4088_IOCON_REG_P1_14:
		return s->iocon_P1_14;
	case LPC4088_IOCON_REG_P1_15:
		return s->iocon_P1_15;
	case LPC4088_IOCON_REG_P1_16:
		return s->iocon_P1_16;
	case LPC4088_IOCON_REG_P1_17:
		return s->iocon_P1_17;
	case LPC4088_IOCON_REG_P1_18:
		return s->iocon_P1_18;
	case LPC4088_IOCON_REG_P1_19:
		return s->iocon_P1_19;
	case LPC4088_IOCON_REG_P1_20:
		return s->iocon_P1_20;
	case LPC4088_IOCON_REG_P1_21:
		return s->iocon_P1_21;
	case LPC4088_IOCON_REG_P1_22:
		return s->iocon_P1_22;
	case LPC4088_IOCON_REG_P1_23:
		return s->iocon_P1_23;
	case LPC4088_IOCON_REG_P1_24:
		return s->iocon_P1_24;
	case LPC4088_IOCON_REG_P1_25:
		return s->iocon_P1_25;
	case LPC4088_IOCON_REG_P1_26:
		return s->iocon_P1_26;
	case LPC4088_IOCON_REG_P1_27:
		return s->iocon_P1_27;
	case LPC4088_IOCON_REG_P1_28:
		return s->iocon_P1_28;
	case LPC4088_IOCON_REG_P1_29:
		return s->iocon_P1_29;
	case LPC4088_IOCON_REG_P1_30:
		return s->iocon_P1_30;
	case LPC4088_IOCON_REG_P1_31:
		return s->iocon_P1_31;
	case LPC4088_IOCON_REG_P2_0:
		return s->iocon_P2_0;
	case LPC4088_IOCON_REG_P2_1:
		return s->iocon_P2_1;
	case LPC4088_IOCON_REG_P2_2:
		return s->iocon_P2_2;
	case LPC4088_IOCON_REG_P2_3:
		return s->iocon_P2_3;
	case LPC4088_IOCON_REG_P2_4:
		return s->iocon_P2_4;
	case LPC4088_IOCON_REG_P2_5:
		return s->iocon_P2_5;
	case LPC4088_IOCON_REG_P2_6:
		return s->iocon_P2_6;
	case LPC4088_IOCON_REG_P2_7:
		return s->iocon_P2_7;
	case LPC4088_IOCON_REG_P2_8:
		return s->iocon_P2_8;
	case LPC4088_IOCON_REG_P2_9:
		return s->iocon_P2_9;
	case LPC4088_IOCON_REG_P2_10:
		return s->iocon_P2_10;
	case LPC4088_IOCON_REG_P2_11:
		return s->iocon_P2_11;
	case LPC4088_IOCON_REG_P2_12:
		return s->iocon_P2_12;
	case LPC4088_IOCON_REG_P2_13:
		return s->iocon_P2_13;
	case LPC4088_IOCON_REG_P2_14:
		return s->iocon_P2_14;
	case LPC4088_IOCON_REG_P2_15:
		return s->iocon_P2_15;
	case LPC4088_IOCON_REG_P2_16:
		return s->iocon_P2_16;
	case LPC4088_IOCON_REG_P2_17:
		return s->iocon_P2_17;
	case LPC4088_IOCON_REG_P2_18:
		return s->iocon_P2_18;
	case LPC4088_IOCON_REG_P2_19:
		return s->iocon_P2_19;
	case LPC4088_IOCON_REG_P2_20:
		return s->iocon_P2_20;
	case LPC4088_IOCON_REG_P2_21:
		return s->iocon_P2_21;
	case LPC4088_IOCON_REG_P2_22:
		return s->iocon_P2_22;
	case LPC4088_IOCON_REG_P2_23:
		return s->iocon_P2_23;
	case LPC4088_IOCON_REG_P2_24:
		return s->iocon_P2_24;
	case LPC4088_IOCON_REG_P2_25:
		return s->iocon_P2_25;
	case LPC4088_IOCON_REG_P2_26:
		return s->iocon_P2_26;
	case LPC4088_IOCON_REG_P2_27:
		return s->iocon_P2_27;
	case LPC4088_IOCON_REG_P2_28:
		return s->iocon_P2_28;
	case LPC4088_IOCON_REG_P2_29:
		return s->iocon_P2_29;
	case LPC4088_IOCON_REG_P2_30:
		return s->iocon_P2_30;
	case LPC4088_IOCON_REG_P2_31:
		return s->iocon_P2_31;
	case LPC4088_IOCON_REG_P3_0:
		return s->iocon_P3_0;
	case LPC4088_IOCON_REG_P3_1:
		return s->iocon_P3_1;
	case LPC4088_IOCON_REG_P3_2:
		return s->iocon_P3_2;
	case LPC4088_IOCON_REG_P3_3:
		return s->iocon_P3_3;
	case LPC4088_IOCON_REG_P3_4:
		return s->iocon_P3_4;
	case LPC4088_IOCON_REG_P3_5:
		return s->iocon_P3_5;
	case LPC4088_IOCON_REG_P3_6:
		return s->iocon_P3_6;
	case LPC4088_IOCON_REG_P3_7:
		return s->iocon_P3_7;
	case LPC4088_IOCON_REG_P3_8:
		return s->iocon_P3_8;
	case LPC4088_IOCON_REG_P3_9:
		return s->iocon_P3_9;
	case LPC4088_IOCON_REG_P3_10:
		return s->iocon_P3_10;
	case LPC4088_IOCON_REG_P3_11:
		return s->iocon_P3_11;
	case LPC4088_IOCON_REG_P3_12:
		return s->iocon_P3_12;
	case LPC4088_IOCON_REG_P3_13:
		return s->iocon_P3_13;
	case LPC4088_IOCON_REG_P3_14:
		return s->iocon_P3_14;
	case LPC4088_IOCON_REG_P3_15:
		return s->iocon_P3_15;
	case LPC4088_IOCON_REG_P3_16:
		return s->iocon_P3_16;
	case LPC4088_IOCON_REG_P3_17:
		return s->iocon_P3_17;
	case LPC4088_IOCON_REG_P3_18:
		return s->iocon_P3_18;
	case LPC4088_IOCON_REG_P3_19:
		return s->iocon_P3_19;
	case LPC4088_IOCON_REG_P3_20:
		return s->iocon_P3_20;
	case LPC4088_IOCON_REG_P3_21:
		return s->iocon_P3_21;
	case LPC4088_IOCON_REG_P3_22:
		return s->iocon_P3_22;
	case LPC4088_IOCON_REG_P3_23:
		return s->iocon_P3_23;
	case LPC4088_IOCON_REG_P3_24:
		return s->iocon_P3_24;
	case LPC4088_IOCON_REG_P3_25:
		return s->iocon_P3_25;
	case LPC4088_IOCON_REG_P3_26:
		return s->iocon_P3_26;
	case LPC4088_IOCON_REG_P3_27:
		return s->iocon_P3_27;
	case LPC4088_IOCON_REG_P3_28:
		return s->iocon_P3_28;
	case LPC4088_IOCON_REG_P3_29:
		return s->iocon_P3_29;
	case LPC4088_IOCON_REG_P3_30:
		return s->iocon_P3_30;
	case LPC4088_IOCON_REG_P3_31:
		return s->iocon_P3_31;
	case LPC4088_IOCON_REG_P4_0:
		return s->iocon_P4_0;
	case LPC4088_IOCON_REG_P4_1:
		return s->iocon_P4_1;
	case LPC4088_IOCON_REG_P4_2:
		return s->iocon_P4_2;
	case LPC4088_IOCON_REG_P4_3:
		return s->iocon_P4_3;
	case LPC4088_IOCON_REG_P4_4:
		return s->iocon_P4_4;
	case LPC4088_IOCON_REG_P4_5:
		return s->iocon_P4_5;
	case LPC4088_IOCON_REG_P4_6:
		return s->iocon_P4_6;
	case LPC4088_IOCON_REG_P4_7:
		return s->iocon_P4_7;
	case LPC4088_IOCON_REG_P4_8:
		return s->iocon_P4_8;
	case LPC4088_IOCON_REG_P4_9:
		return s->iocon_P4_9;
	case LPC4088_IOCON_REG_P4_10:
		return s->iocon_P4_10;
	case LPC4088_IOCON_REG_P4_11:
		return s->iocon_P4_11;
	case LPC4088_IOCON_REG_P4_12:
		return s->iocon_P4_12;
	case LPC4088_IOCON_REG_P4_13:
		return s->iocon_P4_13;
	case LPC4088_IOCON_REG_P4_14:
		return s->iocon_P4_14;
	case LPC4088_IOCON_REG_P4_15:
		return s->iocon_P4_15;
	case LPC4088_IOCON_REG_P4_16:
		return s->iocon_P4_16;
	case LPC4088_IOCON_REG_P4_17:
		return s->iocon_P4_17;
	case LPC4088_IOCON_REG_P4_18:
		return s->iocon_P4_18;
	case LPC4088_IOCON_REG_P4_19:
		return s->iocon_P4_19;
	case LPC4088_IOCON_REG_P4_20:
		return s->iocon_P4_20;
	case LPC4088_IOCON_REG_P4_21:
		return s->iocon_P4_21;
	case LPC4088_IOCON_REG_P4_22:
		return s->iocon_P4_22;
	case LPC4088_IOCON_REG_P4_23:
		return s->iocon_P4_23;
	case LPC4088_IOCON_REG_P4_24:
		return s->iocon_P4_24;
	case LPC4088_IOCON_REG_P4_25:
		return s->iocon_P4_25;
	case LPC4088_IOCON_REG_P4_26:
		return s->iocon_P4_26;
	case LPC4088_IOCON_REG_P4_27:
		return s->iocon_P4_27;
	case LPC4088_IOCON_REG_P4_28:
		return s->iocon_P4_28;
	case LPC4088_IOCON_REG_P4_29:
		return s->iocon_P4_29;
	case LPC4088_IOCON_REG_P4_30:
		return s->iocon_P4_30;
	case LPC4088_IOCON_REG_P4_31:
		return s->iocon_P4_31;
	case LPC4088_IOCON_REG_P5_0:
		return s->iocon_P5_0;
	case LPC4088_IOCON_REG_P5_1:
		return s->iocon_P5_1;
	case LPC4088_IOCON_REG_P5_2:
		return s->iocon_P5_2;
	case LPC4088_IOCON_REG_P5_3:
		return s->iocon_P5_3;
	case LPC4088_IOCON_REG_P5_4:
		return s->iocon_P5_4;
    default:
        qemu_log_mask(LOG_GUEST_ERROR,"%s: Bad offset 0x%" HWADDR_PRIx "\n", __func__, addr);
    }

