karacasoft/qemu/hw/misc/lpc4088_iocon.c
    return 0;
}

static void lpc4088_iocon_write(void *opaque, hwaddr addr, uint64_t val64, unsigned int size) {
    LPC4088IOCONState *s = opaque;
    uint32_t value = (uint32_t) val64;
			 
	DEBUG_PRINT("(%s, value = 0x%" PRIx32 ")\n","IOCON_Write",(uint32_t) value);

    switch (addr) {
    case LPC4088_IOCON_REG_P0_0:
		s->iocon_P0_0 = value;
		break;
	case LPC4088_IOCON_REG_P0_1:
		s->iocon_P0_1 = value;
		break;
	case LPC4088_IOCON_REG_P0_2:
		s->iocon_P0_2 = value;
		break;
	case LPC4088_IOCON_REG_P0_3:
		s->iocon_P0_3 = value;
		break;
	case LPC4088_IOCON_REG_P0_4:
		s->iocon_P0_4 = value;
		break;
	case LPC4088_IOCON_REG_P0_5:
		s->iocon_P0_5 = value;
		break;
	case LPC4088_IOCON_REG_P0_6:
		s->iocon_P0_6 = value;
		break;
	case LPC4088_IOCON_REG_P0_7:
		s->iocon_P0_7 = value;
		break;
	case LPC4088_IOCON_REG_P0_8:
		s->iocon_P0_8 = value;
		break;
	case LPC4088_IOCON_REG_P0_9:
		s->iocon_P0_9 = value;
		break;
	case LPC4088_IOCON_REG_P0_10:
		s->iocon_P0_10 = value;
		break;
	case LPC4088_IOCON_REG_P0_11:
		s->iocon_P0_11 = value;
		break;
	case LPC4088_IOCON_REG_P0_12:
		s->iocon_P0_12 = value;
		break;
	case LPC4088_IOCON_REG_P0_13:
		s->iocon_P0_13 = value;
		break;
	case LPC4088_IOCON_REG_P0_14:
		s->iocon_P0_14 = value;
		break;
	case LPC4088_IOCON_REG_P0_15:
		s->iocon_P0_15 = value;
		break;
	case LPC4088_IOCON_REG_P0_16:
		s->iocon_P0_16 = value;
		break;
	case LPC4088_IOCON_REG_P0_17:
		s->iocon_P0_17 = value;
		break;
	case LPC4088_IOCON_REG_P0_18:
		s->iocon_P0_18 = value;
		break;
	case LPC4088_IOCON_REG_P0_19:
		s->iocon_P0_19 = value;
		break;
	case LPC4088_IOCON_REG_P0_20:
		s->iocon_P0_20 = value;
		break;
	case LPC4088_IOCON_REG_P0_21:
		s->iocon_P0_21 = value;
		break;
	case LPC4088_IOCON_REG_P0_22:
		s->iocon_P0_22 = value;
		break;
	case LPC4088_IOCON_REG_P0_23:
		s->iocon_P0_23 = value;
		break;
	case LPC4088_IOCON_REG_P0_24:
		s->iocon_P0_24 = value;
		break;
	case LPC4088_IOCON_REG_P0_25:
		s->iocon_P0_25 = value;
		break;
	case LPC4088_IOCON_REG_P0_26:
		s->iocon_P0_26 = value;
		break;
	case LPC4088_IOCON_REG_P0_27:
		s->iocon_P0_27 = value;
		break;
	case LPC4088_IOCON_REG_P0_28:
		s->iocon_P0_28 = value;
		break;
	case LPC4088_IOCON_REG_P0_29:
		s->iocon_P0_29 = value;
		break;
	case LPC4088_IOCON_REG_P0_30:
		s->iocon_P0_30 = value;
		break;
	case LPC4088_IOCON_REG_P0_31:
		s->iocon_P0_31 = value;
		break;
	case LPC4088_IOCON_REG_P1_0:
		s->iocon_P1_0 = value;
		break;
	case LPC4088_IOCON_REG_P1_1:
		s->iocon_P1_1 = value;
		break;
	case LPC4088_IOCON_REG_P1_2:
		s->iocon_P1_2 = value;
		break;
	case LPC4088_IOCON_REG_P1_3:
		s->iocon_P1_3 = value;
		break;
	case LPC4088_IOCON_REG_P1_4:
		s->iocon_P1_4 = value;
		break;
	case LPC4088_IOCON_REG_P1_5:
		s->iocon_P1_5 = value;
		break;
	case LPC4088_IOCON_REG_P1_6:
		s->iocon_P1_6 = value;
		break;
	case LPC4088_IOCON_REG_P1_7:
		s->iocon_P1_7 = value;
		break;
	case LPC4088_IOCON_REG_P1_8:
		s->iocon_P1_8 = value;
		break;
	case LPC4088_IOCON_REG_P1_9:
		s->iocon_P1_9 = value;
		break;
	case LPC4088_IOCON_REG_P1_10:
		s->iocon_P1_10 = value;
		break;
	case LPC4088_IOCON_REG_P1_11:
		s->iocon_P1_11 = value;
		break;
	case LPC4088_IOCON_REG_P1_12:
		s->iocon_P1_12 = value;
		break;
	case LPC4088_IOCON_REG_P1_13:
		s->iocon_P1_13 = value;
		break;
	case LPC4088_IOCON_REG_P1_14:
		s->iocon_P1_14 = value;
		break;
	case LPC4088_IOCON_REG_P1_15:
		s->iocon_P1_15 = value;
		break;
	case LPC4088_IOCON_REG_P1_16:
		s->iocon_P1_16 = value;
		break;
	case LPC4088_IOCON_REG_P1_17:
		s->iocon_P1_17 = value;
		break;
	case LPC4088_IOCON_REG_P1_18:
		s->iocon_P1_18 = value;
		break;
	case LPC4088_IOCON_REG_P1_19:
		s->iocon_P1_19 = value;
		break;
	case LPC4088_IOCON_REG_P1_20:
		s->iocon_P1_20 = value;
		break;
	case LPC4088_IOCON_REG_P1_21:
		s->iocon_P1_21 = value;
		break;
	case LPC4088_IOCON_REG_P1_22:
		s->iocon_P1_22 = value;
		break;
	case LPC4088_IOCON_REG_P1_23:
		s->iocon_P1_23 = value;
		break;
	case LPC4088_IOCON_REG_P1_24:
		s->iocon_P1_24 = value;
		break;
	case LPC4088_IOCON_REG_P1_25:
		s->iocon_P1_25 = value;
		break;
	case LPC4088_IOCON_REG_P1_26:
		s->iocon_P1_26 = value;
		break;
	case LPC4088_IOCON_REG_P1_27:
		s->iocon_P1_27 = value;
		break;
	case LPC4088_IOCON_REG_P1_28:
		s->iocon_P1_28 = value;
		break;
	case LPC4088_IOCON_REG_P1_29:
		s->iocon_P1_29 = value;
		break;
	case LPC4088_IOCON_REG_P1_30:
		s->iocon_P1_30 = value;
		break;
	case LPC4088_IOCON_REG_P1_31:
		s->iocon_P1_31 = value;
		break;
	case LPC4088_IOCON_REG_P2_0:
		s->iocon_P2_0 = value;
		break;
	case LPC4088_IOCON_REG_P2_1:
		s->iocon_P2_1 = value;
		break;
	case LPC4088_IOCON_REG_P2_2:
		s->iocon_P2_2 = value;
		break;
	case LPC4088_IOCON_REG_P2_3:
		s->iocon_P2_3 = value;
		break;
	case LPC4088_IOCON_REG_P2_4:
		s->iocon_P2_4 = value;
		break;
	case LPC4088_IOCON_REG_P2_5:
		s->iocon_P2_5 = value;
		break;
	case LPC4088_IOCON_REG_P2_6:
		s->iocon_P2_6 = value;
		break;
	case LPC4088_IOCON_REG_P2_7:
		s->iocon_P2_7 = value;
		break;
	case LPC4088_IOCON_REG_P2_8:
		s->iocon_P2_8 = value;
		break;
	case LPC4088_IOCON_REG_P2_9:
		s->iocon_P2_9 = value;
		break;
	case LPC4088_IOCON_REG_P2_10:
		s->iocon_P2_10 = value;
		break;
	case LPC4088_IOCON_REG_P2_11:
		s->iocon_P2_11 = value;
		break;
	case LPC4088_IOCON_REG_P2_12:
		s->iocon_P2_12 = value;
		break;
	case LPC4088_IOCON_REG_P2_13:
		s->iocon_P2_13 = value;
		break;
	case LPC4088_IOCON_REG_P2_14:
		s->iocon_P2_14 = value;
		break;
	case LPC4088_IOCON_REG_P2_15:
		s->iocon_P2_15 = value;
		break;
	case LPC4088_IOCON_REG_P2_16:
		s->iocon_P2_16 = value;
		break;
	case LPC4088_IOCON_REG_P2_17:
		s->iocon_P2_17 = value;
		break;
	case LPC4088_IOCON_REG_P2_18:
		s->iocon_P2_18 = value;
		break;
	case LPC4088_IOCON_REG_P2_19:
		s->iocon_P2_19 = value;
		break;
	case LPC4088_IOCON_REG_P2_20:
		s->iocon_P2_20 = value;
		break;
	case LPC4088_IOCON_REG_P2_21:
		s->iocon_P2_21 = value;
		break;
	case LPC4088_IOCON_REG_P2_22:
		s->iocon_P2_22 = value;
		break;
	case LPC4088_IOCON_REG_P2_23:
		s->iocon_P2_23 = value;
		break;
	case LPC4088_IOCON_REG_P2_24:
		s->iocon_P2_24 = value;
		break;
	case LPC4088_IOCON_REG_P2_25:
		s->iocon_P2_25 = value;
		break;
	case LPC4088_IOCON_REG_P2_26:
		s->iocon_P2_26 = value;
		break;
	case LPC4088_IOCON_REG_P2_27:
		s->iocon_P2_27 = value;
		break;
	case LPC4088_IOCON_REG_P2_28:
		s->iocon_P2_28 = value;
		break;
	case LPC4088_IOCON_REG_P2_29:
		s->iocon_P2_29 = value;
		break;
	case LPC4088_IOCON_REG_P2_30:
		s->iocon_P2_30 = value;
		break;
	case LPC4088_IOCON_REG_P2_31:
		s->iocon_P2_31 = value;
		break;
	case LPC4088_IOCON_REG_P3_0:
		s->iocon_P3_0 = value;
		break;
	case LPC4088_IOCON_REG_P3_1:
		s->iocon_P3_1 = value;
		break;
	case LPC4088_IOCON_REG_P3_2:
		s->iocon_P3_2 = value;
		break;
	case LPC4088_IOCON_REG_P3_3:
		s->iocon_P3_3 = value;
		break;
	case LPC4088_IOCON_REG_P3_4:
		s->iocon_P3_4 = value;
		break;
	case LPC4088_IOCON_REG_P3_5:
		s->iocon_P3_5 = value;
		break;
	case LPC4088_IOCON_REG_P3_6:
		s->iocon_P3_6 = value;
		break;
	case LPC4088_IOCON_REG_P3_7:
		s->iocon_P3_7 = value;
		break;
	case LPC4088_IOCON_REG_P3_8:
		s->iocon_P3_8 = value;
		break;
	case LPC4088_IOCON_REG_P3_9:
		s->iocon_P3_9 = value;
		break;
	case LPC4088_IOCON_REG_P3_10:
		s->iocon_P3_10 = value;
		break;
	case LPC4088_IOCON_REG_P3_11:
		s->iocon_P3_11 = value;
		break;
	case LPC4088_IOCON_REG_P3_12:
		s->iocon_P3_12 = value;
		break;
	case LPC4088_IOCON_REG_P3_13:
		s->iocon_P3_13 = value;
		break;
	case LPC4088_IOCON_REG_P3_14:
		s->iocon_P3_14 = value;
		break;
	case LPC4088_IOCON_REG_P3_15:
		s->iocon_P3_15 = value;
		break;
	case LPC4088_IOCON_REG_P3_16:
		s->iocon_P3_16 = value;
		break;
	case LPC4088_IOCON_REG_P3_17:
		s->iocon_P3_17 = value;
		break;
	case LPC4088_IOCON_REG_P3_18:
		s->iocon_P3_18 = value;
		break;
	case LPC4088_IOCON_REG_P3_19:
		s->iocon_P3_19 = value;
		break;
	case LPC4088_IOCON_REG_P3_20:
		s->iocon_P3_20 = value;
		break;
	case LPC4088_IOCON_REG_P3_21:
		s->iocon_P3_21 = value;
		break;
	case LPC4088_IOCON_REG_P3_22:
		s->iocon_P3_22 = value;
		break;
	case LPC4088_IOCON_REG_P3_23:
		s->iocon_P3_23 = value;
		break;
	case LPC4088_IOCON_REG_P3_24:
		s->iocon_P3_24 = value;
		break;
	case LPC4088_IOCON_REG_P3_25:
		s->iocon_P3_25 = value;
		break;
	case LPC4088_IOCON_REG_P3_26:
		s->iocon_P3_26 = value;
		break;
	case LPC4088_IOCON_REG_P3_27:
		s->iocon_P3_27 = value;
		break;
	case LPC4088_IOCON_REG_P3_28:
		s->iocon_P3_28 = value;
		break;
	case LPC4088_IOCON_REG_P3_29:
		s->iocon_P3_29 = value;
		break;
	case LPC4088_IOCON_REG_P3_30:
		s->iocon_P3_30 = value;
		break;
	case LPC4088_IOCON_REG_P3_31:
		s->iocon_P3_31 = value;
		break;
	case LPC4088_IOCON_REG_P4_0:
		s->iocon_P4_0 = value;
		break;
	case LPC4088_IOCON_REG_P4_1:
		s->iocon_P4_1 = value;
		break;
	case LPC4088_IOCON_REG_P4_2:
		s->iocon_P4_2 = value;
		break;
	case LPC4088_IOCON_REG_P4_3:
		s->iocon_P4_3 = value;
		break;
	case LPC4088_IOCON_REG_P4_4:
		s->iocon_P4_4 = value;
		break;
	case LPC4088_IOCON_REG_P4_5:
		s->iocon_P4_5 = value;
		break;
	case LPC4088_IOCON_REG_P4_6:
		s->iocon_P4_6 = value;
		break;
	case LPC4088_IOCON_REG_P4_7:
		s->iocon_P4_7 = value;
		break;
	case LPC4088_IOCON_REG_P4_8:
		s->iocon_P4_8 = value;
		break;
	case LPC4088_IOCON_REG_P4_9:
		s->iocon_P4_9 = value;
		break;
	case LPC4088_IOCON_REG_P4_10:
		s->iocon_P4_10 = value;
		break;
	case LPC4088_IOCON_REG_P4_11:
		s->iocon_P4_11 = value;
		break;
	case LPC4088_IOCON_REG_P4_12:
		s->iocon_P4_12 = value;
		break;
	case LPC4088_IOCON_REG_P4_13:
		s->iocon_P4_13 = value;
		break;
	case LPC4088_IOCON_REG_P4_14:
		s->iocon_P4_14 = value;
		break;
	case LPC4088_IOCON_REG_P4_15:
		s->iocon_P4_15 = value;
		break;
	case LPC4088_IOCON_REG_P4_16:
		s->iocon_P4_16 = value;
		break;
	case LPC4088_IOCON_REG_P4_17:
		s->iocon_P4_17 = value;
		break;
	case LPC4088_IOCON_REG_P4_18:
		s->iocon_P4_18 = value;
		break;
	case LPC4088_IOCON_REG_P4_19:
		s->iocon_P4_19 = value;
		break;
	case LPC4088_IOCON_REG_P4_20:
		s->iocon_P4_20 = value;
		break;
	case LPC4088_IOCON_REG_P4_21:
		s->iocon_P4_21 = value;
		break;
	case LPC4088_IOCON_REG_P4_22:
		s->iocon_P4_22 = value;
		break;
	case LPC4088_IOCON_REG_P4_23:
		s->iocon_P4_23 = value;
		break;
	case LPC4088_IOCON_REG_P4_24:
		s->iocon_P4_24 = value;
		break;
	case LPC4088_IOCON_REG_P4_25:
		s->iocon_P4_25 = value;
		break;
	case LPC4088_IOCON_REG_P4_26:
		s->iocon_P4_26 = value;
		break;
	case LPC4088_IOCON_REG_P4_27:
		s->iocon_P4_27 = value;
		break;
	case LPC4088_IOCON_REG_P4_28:
		s->iocon_P4_28 = value;
		break;
	case LPC4088_IOCON_REG_P4_29:
		s->iocon_P4_29 = value;
		break;
	case LPC4088_IOCON_REG_P4_30:
		s->iocon_P4_30 = value;
		break;
	case LPC4088_IOCON_REG_P4_31:
		s->iocon_P4_31 = value;
		break;
	case LPC4088_IOCON_REG_P5_0:
		s->iocon_P5_0 = value;
		break;
	case LPC4088_IOCON_REG_P5_1:
		s->iocon_P5_1 = value;
		break;
	case LPC4088_IOCON_REG_P5_2:
		s->iocon_P5_2 = value;
		break;
	case LPC4088_IOCON_REG_P5_3:
		s->iocon_P5_3 = value;
		break;
	case LPC4088_IOCON_REG_P5_4:
		s->iocon_P5_4 = value;
		break;
    default:
        qemu_log_mask(LOG_GUEST_ERROR,"%s: Bad offset 0x%" HWADDR_PRIx "\n", __func__, addr);
    }
}

static const MemoryRegionOps lpc4088_iocon_ops = {
    .read = lpc4088_iocon_read,
    .write = lpc4088_iocon_write,
    .endianness = DEVICE_NATIVE_ENDIAN,
    .impl.min_access_size = 4,
    .impl.max_access_size = 4,
};

