karacasoft/qemu/hw/misc/lpc4088_iocon.c
static const VMStateDescription vmstate_lpc4088_iocon = {
    .name = TYPE_LPC4088_IOCON,
    .version_id = 1,
    .minimum_version_id = 1,
    .fields = (VMStateField[]) {
        VMSTATE_UINT32(iocon_P0_0, LPC4088IOCONState),
		VMSTATE_UINT32(iocon_P0_1, LPC4088IOCONState),
		VMSTATE_UINT32(iocon_P0_2, LPC4088IOCONState),
		VMSTATE_UINT32(iocon_P0_3, LPC4088IOCONState),
		VMSTATE_UINT32(iocon_P0_4, LPC4088IOCONState),
		VMSTATE_UINT32(iocon_P0_5, LPC4088IOCONState),
		VMSTATE_UINT32(iocon_P0_6, LPC4088IOCONState),
		VMSTATE_UINT32(iocon_P0_7, LPC4088IOCONState),

		VMSTATE_UINT32(iocon_P0_8, LPC4088IOCONState),				/* 0x020 */
		VMSTATE_UINT32(iocon_P0_9, LPC4088IOCONState),
		VMSTATE_UINT32(iocon_P0_10, LPC4088IOCONState),
		VMSTATE_UINT32(iocon_P0_11, LPC4088IOCONState),
		VMSTATE_UINT32(iocon_P0_12, LPC4088IOCONState),
		VMSTATE_UINT32(iocon_P0_13, LPC4088IOCONState),
		VMSTATE_UINT32(iocon_P0_14, LPC4088IOCONState),
		VMSTATE_UINT32(iocon_P0_15, LPC4088IOCONState),

		VMSTATE_UINT32(iocon_P0_16, LPC4088IOCONState),				/* 0x040 */
		VMSTATE_UINT32(iocon_P0_17, LPC4088IOCONState),
		VMSTATE_UINT32(iocon_P0_18, LPC4088IOCONState),
		VMSTATE_UINT32(iocon_P0_19, LPC4088IOCONState),
		VMSTATE_UINT32(iocon_P0_20, LPC4088IOCONState),
		VMSTATE_UINT32(iocon_P0_21, LPC4088IOCONState),
		VMSTATE_UINT32(iocon_P0_22, LPC4088IOCONState),
		VMSTATE_UINT32(iocon_P0_23, LPC4088IOCONState),

		VMSTATE_UINT32(iocon_P0_24, LPC4088IOCONState),				/* 0x060 */
		VMSTATE_UINT32(iocon_P0_25, LPC4088IOCONState),
		VMSTATE_UINT32(iocon_P0_26, LPC4088IOCONState),
		VMSTATE_UINT32(iocon_P0_27, LPC4088IOCONState),
		VMSTATE_UINT32(iocon_P0_28, LPC4088IOCONState),
		VMSTATE_UINT32(iocon_P0_29, LPC4088IOCONState),
		VMSTATE_UINT32(iocon_P0_30, LPC4088IOCONState),
		VMSTATE_UINT32(iocon_P0_31, LPC4088IOCONState),

		VMSTATE_UINT32(iocon_P1_0, LPC4088IOCONState),				/* 0x080 */
		VMSTATE_UINT32(iocon_P1_1, LPC4088IOCONState),
		VMSTATE_UINT32(iocon_P1_2, LPC4088IOCONState),
		VMSTATE_UINT32(iocon_P1_3, LPC4088IOCONState),
		VMSTATE_UINT32(iocon_P1_4, LPC4088IOCONState),
		VMSTATE_UINT32(iocon_P1_5, LPC4088IOCONState),
		VMSTATE_UINT32(iocon_P1_6, LPC4088IOCONState),
		VMSTATE_UINT32(iocon_P1_7, LPC4088IOCONState),

		VMSTATE_UINT32(iocon_P1_8, LPC4088IOCONState),				/* 0x0A0 */
		VMSTATE_UINT32(iocon_P1_9, LPC4088IOCONState),
		VMSTATE_UINT32(iocon_P1_10, LPC4088IOCONState),
		VMSTATE_UINT32(iocon_P1_11, LPC4088IOCONState),
		VMSTATE_UINT32(iocon_P1_12, LPC4088IOCONState),
		VMSTATE_UINT32(iocon_P1_13, LPC4088IOCONState),
		VMSTATE_UINT32(iocon_P1_14, LPC4088IOCONState),
		VMSTATE_UINT32(iocon_P1_15, LPC4088IOCONState),

		VMSTATE_UINT32(iocon_P1_16, LPC4088IOCONState),				/* 0x0C0 */
		VMSTATE_UINT32(iocon_P1_17, LPC4088IOCONState),
		VMSTATE_UINT32(iocon_P1_18, LPC4088IOCONState),
		VMSTATE_UINT32(iocon_P1_19, LPC4088IOCONState),
		VMSTATE_UINT32(iocon_P1_20, LPC4088IOCONState),
		VMSTATE_UINT32(iocon_P1_21, LPC4088IOCONState),
		VMSTATE_UINT32(iocon_P1_22, LPC4088IOCONState),
		VMSTATE_UINT32(iocon_P1_23, LPC4088IOCONState),

		VMSTATE_UINT32(iocon_P1_24, LPC4088IOCONState),				/* 0x0E0 */
		VMSTATE_UINT32(iocon_P1_25, LPC4088IOCONState),
		VMSTATE_UINT32(iocon_P1_26, LPC4088IOCONState),
		VMSTATE_UINT32(iocon_P1_27, LPC4088IOCONState),
		VMSTATE_UINT32(iocon_P1_28, LPC4088IOCONState),
		VMSTATE_UINT32(iocon_P1_29, LPC4088IOCONState),
		VMSTATE_UINT32(iocon_P1_30, LPC4088IOCONState),
		VMSTATE_UINT32(iocon_P1_31, LPC4088IOCONState),

		VMSTATE_UINT32(iocon_P2_0, LPC4088IOCONState),				/* 0x100 */
		VMSTATE_UINT32(iocon_P2_1, LPC4088IOCONState),
		VMSTATE_UINT32(iocon_P2_2, LPC4088IOCONState),
		VMSTATE_UINT32(iocon_P2_3, LPC4088IOCONState),
		VMSTATE_UINT32(iocon_P2_4, LPC4088IOCONState),
		VMSTATE_UINT32(iocon_P2_5, LPC4088IOCONState),
		VMSTATE_UINT32(iocon_P2_6, LPC4088IOCONState),
		VMSTATE_UINT32(iocon_P2_7, LPC4088IOCONState),

		VMSTATE_UINT32(iocon_P2_8, LPC4088IOCONState),				/* 0x120 */
		VMSTATE_UINT32(iocon_P2_9, LPC4088IOCONState),
		VMSTATE_UINT32(iocon_P2_10, LPC4088IOCONState),
		VMSTATE_UINT32(iocon_P2_11, LPC4088IOCONState),
		VMSTATE_UINT32(iocon_P2_12, LPC4088IOCONState),
		VMSTATE_UINT32(iocon_P2_13, LPC4088IOCONState),
		VMSTATE_UINT32(iocon_P2_14, LPC4088IOCONState),
		VMSTATE_UINT32(iocon_P2_15, LPC4088IOCONState),

		VMSTATE_UINT32(iocon_P2_16, LPC4088IOCONState),				/* 0x140 */
		VMSTATE_UINT32(iocon_P2_17, LPC4088IOCONState),
		VMSTATE_UINT32(iocon_P2_18, LPC4088IOCONState),
		VMSTATE_UINT32(iocon_P2_19, LPC4088IOCONState),
		VMSTATE_UINT32(iocon_P2_20, LPC4088IOCONState),
		VMSTATE_UINT32(iocon_P2_21, LPC4088IOCONState),
		VMSTATE_UINT32(iocon_P2_22, LPC4088IOCONState),
		VMSTATE_UINT32(iocon_P2_23, LPC4088IOCONState),

		VMSTATE_UINT32(iocon_P2_24, LPC4088IOCONState),				/* 0x160 */
		VMSTATE_UINT32(iocon_P2_25, LPC4088IOCONState),
		VMSTATE_UINT32(iocon_P2_26, LPC4088IOCONState),
		VMSTATE_UINT32(iocon_P2_27, LPC4088IOCONState),
		VMSTATE_UINT32(iocon_P2_28, LPC4088IOCONState),
		VMSTATE_UINT32(iocon_P2_29, LPC4088IOCONState),
		VMSTATE_UINT32(iocon_P2_30, LPC4088IOCONState),
		VMSTATE_UINT32(iocon_P2_31, LPC4088IOCONState),

		VMSTATE_UINT32(iocon_P3_0, LPC4088IOCONState),				/* 0x180 */
		VMSTATE_UINT32(iocon_P3_1, LPC4088IOCONState),
		VMSTATE_UINT32(iocon_P3_2, LPC4088IOCONState),
		VMSTATE_UINT32(iocon_P3_3, LPC4088IOCONState),
		VMSTATE_UINT32(iocon_P3_4, LPC4088IOCONState),
		VMSTATE_UINT32(iocon_P3_5, LPC4088IOCONState),
		VMSTATE_UINT32(iocon_P3_6, LPC4088IOCONState),
		VMSTATE_UINT32(iocon_P3_7, LPC4088IOCONState),

		VMSTATE_UINT32(iocon_P3_8, LPC4088IOCONState),				/* 0x1A0 */
		VMSTATE_UINT32(iocon_P3_9, LPC4088IOCONState),
		VMSTATE_UINT32(iocon_P3_10, LPC4088IOCONState),
		VMSTATE_UINT32(iocon_P3_11, LPC4088IOCONState),
		VMSTATE_UINT32(iocon_P3_12, LPC4088IOCONState),
		VMSTATE_UINT32(iocon_P3_13, LPC4088IOCONState),
		VMSTATE_UINT32(iocon_P3_14, LPC4088IOCONState),
		VMSTATE_UINT32(iocon_P3_15, LPC4088IOCONState),

		VMSTATE_UINT32(iocon_P3_16, LPC4088IOCONState),				/* 0x1C0 */
		VMSTATE_UINT32(iocon_P3_17, LPC4088IOCONState),
		VMSTATE_UINT32(iocon_P3_18, LPC4088IOCONState),
		VMSTATE_UINT32(iocon_P3_19, LPC4088IOCONState),
		VMSTATE_UINT32(iocon_P3_20, LPC4088IOCONState),
		VMSTATE_UINT32(iocon_P3_21, LPC4088IOCONState),
		VMSTATE_UINT32(iocon_P3_22, LPC4088IOCONState),
		VMSTATE_UINT32(iocon_P3_23, LPC4088IOCONState),

