karacasoft/qemu/hw/misc/lpc4088_iocon.c
		VMSTATE_UINT32(iocon_P3_24, LPC4088IOCONState),				/* 0x1E0 */
		VMSTATE_UINT32(iocon_P3_25, LPC4088IOCONState),
		VMSTATE_UINT32(iocon_P3_26, LPC4088IOCONState),
		VMSTATE_UINT32(iocon_P3_27, LPC4088IOCONState),
		VMSTATE_UINT32(iocon_P3_28, LPC4088IOCONState),
		VMSTATE_UINT32(iocon_P3_29, LPC4088IOCONState),
		VMSTATE_UINT32(iocon_P3_30, LPC4088IOCONState),
		VMSTATE_UINT32(iocon_P3_31, LPC4088IOCONState),

		VMSTATE_UINT32(iocon_P4_0, LPC4088IOCONState),				/* 0x200 */
		VMSTATE_UINT32(iocon_P4_1, LPC4088IOCONState),
		VMSTATE_UINT32(iocon_P4_2, LPC4088IOCONState),
		VMSTATE_UINT32(iocon_P4_3, LPC4088IOCONState),
		VMSTATE_UINT32(iocon_P4_4, LPC4088IOCONState),
		VMSTATE_UINT32(iocon_P4_5, LPC4088IOCONState),
		VMSTATE_UINT32(iocon_P4_6, LPC4088IOCONState),
		VMSTATE_UINT32(iocon_P4_7, LPC4088IOCONState),

		VMSTATE_UINT32(iocon_P4_8, LPC4088IOCONState),				/* 0x220 */
		VMSTATE_UINT32(iocon_P4_9, LPC4088IOCONState),
		VMSTATE_UINT32(iocon_P4_10, LPC4088IOCONState),
		VMSTATE_UINT32(iocon_P4_11, LPC4088IOCONState),
		VMSTATE_UINT32(iocon_P4_12, LPC4088IOCONState),
		VMSTATE_UINT32(iocon_P4_13, LPC4088IOCONState),
		VMSTATE_UINT32(iocon_P4_14, LPC4088IOCONState),
		VMSTATE_UINT32(iocon_P4_15, LPC4088IOCONState),

		VMSTATE_UINT32(iocon_P4_16, LPC4088IOCONState),				/* 0x240 */
		VMSTATE_UINT32(iocon_P4_17, LPC4088IOCONState),
		VMSTATE_UINT32(iocon_P4_18, LPC4088IOCONState),
		VMSTATE_UINT32(iocon_P4_19, LPC4088IOCONState),
		VMSTATE_UINT32(iocon_P4_20, LPC4088IOCONState),
		VMSTATE_UINT32(iocon_P4_21, LPC4088IOCONState),
		VMSTATE_UINT32(iocon_P4_22, LPC4088IOCONState),
		VMSTATE_UINT32(iocon_P4_23, LPC4088IOCONState),

		VMSTATE_UINT32(iocon_P4_24, LPC4088IOCONState),				/* 0x260 */
		VMSTATE_UINT32(iocon_P4_25, LPC4088IOCONState),
		VMSTATE_UINT32(iocon_P4_26, LPC4088IOCONState),
		VMSTATE_UINT32(iocon_P4_27, LPC4088IOCONState),
		VMSTATE_UINT32(iocon_P4_28, LPC4088IOCONState),
		VMSTATE_UINT32(iocon_P4_29, LPC4088IOCONState),
		VMSTATE_UINT32(iocon_P4_30, LPC4088IOCONState),
		VMSTATE_UINT32(iocon_P4_31, LPC4088IOCONState),

		VMSTATE_UINT32(iocon_P5_0, LPC4088IOCONState),				/* 0x280 */
		VMSTATE_UINT32(iocon_P5_1, LPC4088IOCONState),
		VMSTATE_UINT32(iocon_P5_2, LPC4088IOCONState),
		VMSTATE_UINT32(iocon_P5_3, LPC4088IOCONState),
		VMSTATE_UINT32(iocon_P5_4, LPC4088IOCONState),				/* 0x290 */
        VMSTATE_END_OF_LIST()
    }
};

static void lpc4088_iocon_init(Object *obj) {
    LPC4088IOCONState *s = LPC4088IOCON(obj);

    sysbus_init_irq(SYS_BUS_DEVICE(obj), &s->irq);

    memory_region_init_io(&s->mmio, obj, &lpc4088_iocon_ops, s,TYPE_LPC4088_IOCON, LPC4088_IOCON_MEM_SIZE);
    sysbus_init_mmio(SYS_BUS_DEVICE(obj), &s->mmio);
}

static void lpc4088_iocon_class_init(ObjectClass *klass, void *data) {
    DeviceClass *dc = DEVICE_CLASS(klass);

    dc->reset = lpc4088_iocon_reset;
    dc->vmsd = &vmstate_lpc4088_iocon;
}

static const TypeInfo lpc4088_iocon_info = {
    .name          = TYPE_LPC4088_IOCON,
    .parent        = TYPE_SYS_BUS_DEVICE,
    .instance_size = sizeof(LPC4088IOCONState),
    .instance_init = lpc4088_iocon_init,
    .class_init    = lpc4088_iocon_class_init,
};

static void lpc4088_iocon_register_types(void) {
    type_register_static(&lpc4088_iocon_info);
}

type_init(lpc4088_iocon_register_types)
